Repository: massidea/site
Catalog: application/languages/search.tmx
Source language: fi
Languages: en

source: Ei hakutuloksia
en: Nothing found

source: Haku
en: Search

source: Toimiala
en: Industry

source: Innovaatiotyyppi
en: Innovation type

source: Kirjoittaja
en: Author

source: Otsikko
en: Header

source: Katselukertoja
en: Views

source: Haun tulokset
en: Search result

source: Hakusanalla: %s
en: Search term: %s

source: Hakusanan täytyy olla yli 3 merkkiä pitkä
en: The search query length must be over 3 characters long
